import React from "react";
import { Button, H3 } from "@blueprintjs/core";

export const HelpComponent = () => {
  return (
    <div>
      <br />
      <H3>Ο κόμβος δεν έχει εγκατασταθεί</H3>
      <p>
        Αυτό μπορεί εύκολα να διορθωθεί διασφαλίζοντας ότι το Antivirus δεν διαγράφει
        ούτε θέτει σε καραντίνα το Backend: GrinNode.exe. Προκειμένου να το
        επιβεβαιώστε, πρέπει να σιγουρευτείτε ότι το αρχείο GrinNode.exe 
        βρίσκεται μέσα στο φάκελο{" "}
        <code>
          C:\Users\[USERNAME]\AppData\Local\Programs\GrinPlusPlus\resources\app.asar.unpacked\
        </code>
      </p>
      <br />
      <H3>Ο κόμβος δεν εκτελείται</H3>
      <p>
        Αυτό είναι ασυνήθιστο αλλά μπορεί να συμβεί. Το πρώτο πράγμα που θα κάνουμε είναι 
        να ανοίξουμε το Command Prompt πηγαίνοντας στο φάκελο{" "}
        <code>
          C:\Users\[USERNAME]\AppData\Local\Programs\GrinPlusPlus\resources\app.asar.unpacked\bin\
        </code>{" "}
        και να πληκτρολογήσουμε <code>dir GrinNode.exe</code>. Εν συνεχεία πληκτρολογούμε{" "}
        <code>GrinNode.exe</code> και πατάμε ENTER. Εάν η προηγούμενη διαδικασία αποτύχει, 
        θα δούμε ένα μήνυμα με πληροφορίες για ενδεχόμενα σφάλματα.
        Μη διστάσετε{" "}
        <Button
          icon="help"
          minimal={true}
          onClick={() => {
            require("electron").shell.openExternal("https://t.me/GrinPP");
          }}
        >
          να επικοινωνήσετε μαζί μας στο Grin++ Support Channel στο Telegram
        </Button>{" "}
        ζητώντας τη βοήθειά μας. Ενδεχομένως και άλλοι χρήστες να έχουν αντιμετωπίσει 
        το ίδιο πρόβλημα με εσάς.
      </p>
      <br />
      <H3>
        Η διαδικασία κόμβου δεν εκτελείται. Αυτό είναι ασυνήθιστο, αλλά μην ανησυχείτε, 
        απλά πρέπει να επανεκκινήσετε το πορτοφόλι
      </H3>
      <p>
        Ουάου! Aυτό δεν θα έπρεπε ποτέ να συμβεί. Αυτό σημαίνει ότι το Backend ξαφνικά 
        σταμάτησε. Παρακαλούμε να μας ενημερώσετε αναφέροντάς μας το πρόβλημα ή επικοινωνήστε μαζί μας 
        στο Grin++ Telegram Channel.
      </p>
      <br />
      <H3>Κολλήσατε στο &quot;Waiting for Peers&quot;</H3>
      <p>
        Μερικές φορές συμβαίνει μετά την αναβάθμιση του Grin++, να κολλήσετε
        στο &quot;Waiting for Peers&quot;. Για να διορθώσετε το πρόβλημα μπορείτε να κάνετε 2
        πράγματα. Το πρώτο πράγμα που μπορείτε να προσπαθήσετε είναι να <b>επανασυγχρονίσετε</b> 
        την αλυσίδα πατώντας στις ρυθμίσεις το κουμπί του επανασυγχρονισμού 
        κάτω από τις <b>Ενέργειες Κόμβου</b>. Εάν το παραπάνω δεν λειτουργήσει προσπαθήστε αυτό. 
        Κλείστε το Grin++, και πηγαίντε στο{" "}
        <code>C:\Users\[USERNAME]\.GrinPP\MAINNET</code>, διαγράφοντας τον φάκελο <code>NODE</code>.
      </p>
      <br />
      <H3>Η διεύθυνση Grin Slatepack δεν εμφανίζεται</H3>
      <p>
        Αυτό είναι αρκετά ενοχλητικό, ξέρω, αλλά ταυτόχρονα είναι
        αρκετά εύκολο να λυθεί. Μερικοί άνθρωποι χρησιμοποιούν το{" "}
        <code>Niffler Wallet</code> ή το <code>grin-wallet</code> ταυτόχρονα
        με το Grin++. Χωρίς να εμβαθύνουμε στο ζήτημα, προτείνουμε να μην το κάνετε,
        τουλάχιστον ακόμα. Πριν χρησιμοποιήσετε το Grin++, βεβαιωθείτε ότι δεν είναι ανοιχτό κάνενα 
        πορτοφόλι grin. Εαν ακόμα αντιμετωπίζετε πρόβλημα βεβαιωθείτε ότι το{" "}
        <code>tor.exe</code> εκτελείται.
      </p>
      <br />
      <H3>Η Διεύθυνση δεν είναι πράσινη :(</H3>
      <p>
        Αυτό συμβαίνει όταν το <b>Tor</b> δεν είναι σε θέση να συνδεθεί.
        Το πρώτο πράγμα που πρέπει να κάνετε είναι να ελέγξετε αν το τείχος προστασίας σας 
        δεν μπλοκάρει τις συνδέσεις tor. Μετά από αυτό, η διεύθυνσή σας πρέπει να είναι πράσινη.
      </p>
      <br />
    </div>
  );
};
