import React from "react";
import { Button, H3 } from "@blueprintjs/core";

export const HelpComponent = () => {
  return (
    <div>
      <br />
      <H3>Нода не установлена :( </H3>
      <p>
        Печально, но шо поделать: Легко может быть поправлено с помощью отрубания антивируса
        (во всяком случае проверьте, что он ничего не впихнул в карантин наподобие GrinNode.exe),
        если же с антивирем все впорядке, надо убедиться, что файл(GrinNode.exe) лежит по адресу
        is located inside the bin folder at{" "}
        <code>
          C:\Users\[USERNAME]\AppData\Local\Programs\GrinPlusPlus\resources\app.asar.unpacked\
        </code>
      </p>
      <br />
      <H3>Нода не запущена</H3>
      <p>
        Шото явно странное, но тоже бывает. The first thing we’re
        Для начала открываем командную строку и перемещаемся посредством команды cd в {" "}
        <code>
          C:\Users\[USERNAME]\AppData\Local\Programs\GrinPlusPlus\resources\app.asar.unpacked\bin\
        </code>{" "}
        и запускаем собственно вручную, прописав и щелкнув после этого Enter  -  <code>dir GrinNode.exe.</code>. 
	    Ежели шото пошло не так, милости просим в наш уютный канал, "Телеграм канал". 
		скорее всего, 
       {" "}
        <Button
          icon="help"
          minimal={true}
          onClick={() => {
            require("electron").shell.openExternal("https://t.me/GrinPP");
          }}
        >
          Наш телеграмм канал
        </Button>{" "}
		кто-то из пользователей уже столкнулся с этой проблемой и 
		сможет вам так или иначе помочь. 
        
      </p>
      <br />
      <H3>
       Процесс ноды не запущен. Тоже странно, но просто перезапустите кошелек.
      </H3>
      <p>
       !! этого вообще не должно происходить, более того, это означает, что код работает не корректно. 
	   пожалуйста, откройте проблему на гитхабе или же напишите нам в "Телеграм канал".
      </p>
      <br />
      <H3>&quot;Waiting for Peers&quot; застревает на этом моменте </H3>
      <p>
        Чаще всего это возникает при обновлении кошелька . 
		Для решения данной проблемы есть 2 пути. Первое, что можно попробовать - 
		это произвести ресинхронизацию, щелкнув на настройки (левый верхний угол окна) и найти в окошке <b>Ресинхронизация</b> 
        под <b>Действия ноды</b>. Ежели нет, то попробуйте вот что:
		Закройте кошелек Grin++, проходите в <code>C:\Users\[USERNAME]\.GrinPP\MAINNET</code>
        удалите папку NODE. Запускаете кошелек заново. Папка <code>NODE</code> создается заново, это нормально. 
      </p>
      <br />
      <H3>GRIN slatepack адрес не отображется </H3>
      <p>
        Очень раздражающая фигня, поверьте, я знаю, но решается элементарно. 
		Есть у нас отдельные граждане, которые любят
        которые любят запускать несколько кошельков в одно время{" "}
        <code>Niffler Wallet</code> или <code>grin-wallet</code> 
         Grin++, не задаваясь лишними вопросами по процесу, если коротко : 
		 не надо так, как минимум сегодня, так что закройте пожалуйста все 
		 остальные кошели кроме Grin++. 
		 Если же проблема все еще появляется, пожалуйста, убедитесь, что  <code>tor.exe</code> запущен.
      </p>
      <br />
      <H3>Не зелененькое(кошелек не доступен)! :( </H3>
      <p>
        Проблема заключается в том, что <b>Tor</b> не может установить соеденение,
		в первую очередь проверьте Firewall(встроенный в систему или отдельный) 
		на предмет блокирования tor соеденений; 
		далее адрес должен загореться зеленым цветом. 
		
		
<b>И помните, что перезапуск и немного ожидания(3-5 минут) часто решает большинство из этих проблем автоматически.</b>
      </p>
      <br />
    </div>
  );
};
